burgrp/py32-svd/svd/py32f030.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <description>Power control</description>
      <groupName>PWR</groupName>
      <baseAddress>0x40007000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <displayName>CR1</displayName>
          <description>Power control register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00030000</resetValue>
          <fields>
            <field>
              <name>HSION_CTRL</name>
              <description>HSI open time control</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>HSION_CTRL</name>
                <enumeratedValue>
                  <name>WaiteMR</name>
                  <description>Enable HSI after MR is stable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WakeOnVR</name>
                  <description>Enable HSI when VR is on (enable HSI immediately when wakeup)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_RETV</name>
              <description>SRAM retention voltage control</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>SRAM_RETV</name>
                <enumeratedValue>
                  <name>V0_9</name>
                  <description>Supply voltage 0.9 V for SRAM</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1_x</name>
                  <description>Supply voltage 1.0 or 1.2 V (depends on VOS) for SRAM</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPRUN</name>
              <description>Low-power run</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>LPRUN</name>
                <enumeratedValue>
                  <name>MainMode</name>
                  <description>Voltage regulator in Main mode in Low-power run mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LowPowerMode</name>
                  <description>Voltage regulator in low-power mode in Low-power run mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLS_SLPTIME</name>
              <description>Flash wait time after wakeup from the stop mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>FLS_SLPTIME</name>
                <enumeratedValue>
                  <name>FiveMicroSec</name>
                  <description>Flash wait 5 us after wakeup from stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TwoMicroSec</name>
                  <description>Flash wait 2 us after wakeup from stop mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ThreeMicroSec</name>
                  <description>Flash wait 3 us after wakeup from stop mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ExcuteFromSRAM</name>
                  <description>Excute program from SRAM after wakeup from stop mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MRRDY_TIME</name>
              <description>Time selection wakeup from LP to VR</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>MRRDY_TIME</name>
                <enumeratedValue>
                  <name>TwoMicroSec</name>
                  <description>MR ready after 2 us</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ThreeMicroSec</name>
                  <description>MR ready after 3 us</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FourMicroSec</name>
                  <description>MR ready after 4 us</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FiveMicroSec</name>
                  <description>MR ready after 5 us</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VOS</name>
              <description>Voltage scaling range
							selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>VOS</name>
                <enumeratedValue>
                  <name>V1_2</name>
                  <description>1.2 V (range 1)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1_0</name>
                  <description>1.0 V (range 2)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBP</name>
              <description>Disable backup domain write
							protection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DBP</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Access to RTC, RTC Backup and RCC CSR registers disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Access to RTC, RTC Backup and RCC CSR registers enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIAS_CR_SEL</name>
              <description>MR Bias current selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>BIAS_CR_SEL</name>
                <enumeratedValue>
                  <name>FactoryConfig</name>
                  <description>Bias config from factory config bytes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BiasCR</name>
                  <description>Bias config from BIAS_CR register</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIAS_CR</name>
              <description>MR Bias current</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <displayName>CR2</displayName>
          <description>Power control register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000500</resetValue>
          <fields>
            <field>
              <name>FLT_TIME</name>
              <description>Digital filter time configuration</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>FLT_TIME</name>
                <enumeratedValue>
                  <name>T30us</name>
                  <description>Filter time is about 30 us</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T60us</name>
                  <description>Filter time is about 60 us</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T120us</name>
                  <description>Filter time is about 120 us</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T480us</name>
                  <description>Filter time is about 480 us</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T1_92ms</name>
                  <description>Filter time is about 1.92 ms</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T3_8ms</name>
                  <description>Filter time is about 3.8 ms</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T30_7ms</name>
                  <description>Filter time is about 30.7 ms</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLTEN</name>
              <description>Digital filter enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FLTEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Digital filter disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Digital filter enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PVDT</name>
              <description>Power voltage detector  threshold
							selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>PVDT</name>
                <enumeratedValue>
                  <name>V1_8</name>
                  <description>1.8 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V2_0</name>
                  <description>2.0 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V2_2</name>
                  <description>2.2 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V2_4</name>
                  <description>2.4 V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V2_6</name>
                  <description>2.6 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V2_8</name>
                  <description>2.8 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V3_0</name>
                  <description>3.0 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V3_2</name>
                  <description>3.2 V</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PVD_SRCSEL</name>
              <description>Power voltage detector volatage
							selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>PVD_SRCSEL</name>
                <enumeratedValue>
                  <name>Vcc</name>
                  <description>VCC as detector source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB7</name>
                  <description>PB7 pin as detector source</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PVDE</name>
              <description>Power voltage detector
							enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>PVDE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>PVD Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>PVD Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>Power status register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PVDO</name>
              <description>PVD output</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>PVDOR</name>
                <enumeratedValue>
                  <name>AboveThreshold</name>
                  <description>VDD is higher than the PVD threshold selected with the PLS[2:0] bits</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThreshold</name>
                  <description>VDD is lower than the PVD threshold selected with the PLS[2:0] bits</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
