burgrp/py32-svd/svd/py32f030.svd
        <register>
          <name>CFGR3</name>
          <displayName>CFGR3</displayName>
          <description>SYSCFG configuration register
						3</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMA1_MAP</name>
              <description>DMA channel1 requeset selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <name>DMA1_MAP</name>
                <enumeratedValue>
                  <name>ADC</name>
                  <description>ADC DMA requests mapped on DMA?</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_TX</name>
                  <description>SPI1_TX DMA requests mapped on DMA?</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_RX</name>
                  <description>SPI1_RX DMA requests mapped on DMA?</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1_TX</name>
                  <description>USART1_TX DMA requests mapped on DMA?</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1_RX</name>
                  <description>USART1_RX DMA requests mapped on DMA?</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART2_TX</name>
                  <description>USART2_TX DMA requests mapped on DMA?</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART2_RX</name>
                  <description>USART2_RX DMA requests mapped on DMA?</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_TX</name>
                  <description>I2C_TX DMA requests mapped on DMA?</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_RX</name>
                  <description>I2C_RX DMA requests mapped on DMA?</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_CH1</name>
                  <description>TIM1_CH1 DMA requests mapped on DMA?</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_CH2</name>
                  <description>TIM1_CH2 DMA requests mapped on DMA?</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_CH3</name>
                  <description>TIM1_CH3 DMA requests mapped on DMA?</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_CH4</name>
                  <description>TIM1_CH4 DMA requests mapped on DMA?</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_COM</name>
                  <description>TIM1_COM DMA requests mapped on DMA?</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_UP</name>
                  <description>TIM1_UP DMA requests mapped on DMA?</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_TRIG</name>
                  <description>TIM1_TRIG DMA requests mapped on DMA?</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_CH1</name>
                  <description>TIM3_CH1 DMA requests mapped on DMA?</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_CH3</name>
                  <description>TIM3_CH3 DMA requests mapped on DMA?</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_CH4</name>
                  <description>TIM3_CH4 DMA requests mapped on DMA?</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_TRG</name>
                  <description>TIM3_TRG DMA requests mapped on DMA?</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_UP</name>
                  <description>TIM3_UP DMA requests mapped on DMA?</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM16_CH1</name>
                  <description>TIM16_CH1 DMA requests mapped on DMA?</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM16_UP</name>
                  <description>TIM16_UP DMA requests mapped on DMA?</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM17_CH1</name>
                  <description>TIM17_CH1 DMA requests mapped on DMA?</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM17_UP</name>
                  <description>TIM17_UP DMA requests mapped on DMA?</description>
                  <value>27</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA3_MAP</name>
              <description>DMA channel3 requeset selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues derivedFrom="DMA1_MAP"/>
            </field>
            <field>
              <name>DMA2_MAP</name>
              <description>DMA channel2 requeset selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues derivedFrom="DMA1_MAP"/>
            </field>
          </fields>
        </register>
